cask_args appdir: "/Applications", require_sha: false

###########################################
#                                         #
#          GLOBAL CLI TOOLS               #
#                                         #
###########################################


brew 'cmake'
brew 'coreutils'
brew 'docker-compose'
brew 'duti'
brew 'ffmpeg'
brew 'gnupg'
brew 'htop'
brew 'jq'
brew 'git'
brew 'git-delta'
brew 'mas' # Mac App Store
brew "mpv"
brew 'openssl'
brew 'postgresql'
brew 'trash'
brew 'vim'
brew 'wget'
brew 'yarn'
brew 'yt-dlp'

###########################################
#                                         #
#          PROJECT SPECIFIC               #
#                                         #
###########################################

# -- BO

brew 'libyaml'

# -- STREMIO FOR M1

# brew 'qt@5'
# cask 'qt-creator'

###########################################
#                                         #
#                 DEV                     #
#                                         #
###########################################

# -- CLOUD 

# brew 'awscli'
# cask 'google-cloud-sdk'
# brew 'terraform'

# -- LANGUAGES 
brew 'java'
brew 'jenv"'
brew 'rbenv'
brew 'ruby-build'
brew 'pyenv-virtualenv'


###########################################
#                                         #
#                APPS                     #
#                                         #
###########################################

cask 'android-studio'
cask 'appcleaner'
cask "android-file-transfer"
cask 'battle-net'
mas 'Bitwarden', id: 1352778147 # MaS version required for fingerpint unlock
brew 'bitwarden-cli'
cask 'chatgpt'
cask 'coconutbattery'
cask 'discord'
cask 'docker'
cask 'figma'
cask 'firefox'
cask 'google-chrome'
cask 'iterm2'
cask 'keycastr' # Keystroke for screencast
cask 'logitech-g-hub'
cask 'macmediakeyforwarder' # Prevent Music App from lauching. Alternative is notunes
cask 'notion'
# brew "ollama" # Easily run LLM models
mas "PDFGear", id: 6469021132
cask 'postico' # SQL
cask 'postman'
cask 'protonvpn'
cask 'lihaoyun6/tap/quickrecorder' # Screen recording + Shots
cask 'raycast'
mas 'Slack', id: 803453959
cask 'redisinsight' # REDIS
cask 'signal'
cask 'spotify'
cask 'sourcetree'
cask 'steam'
# cask 'stremio' # Stremio is not compiled for M Arch. Using self compiled for now https://github.com/Stremio/stremio-shell/issues/356#issuecomment-2480741535
mas 'The Unarchiver', id: 425424353
cask 'transmission'
cask 'visual-studio-code'
cask 'vlc'
mas 'wireguard', id: 1451685025
mas 'Xcode', id: 497799835
# cask "zoom"

###########################################
#                                         #
#               FONTS                     #
#                                         #
###########################################

cask 'font-fontawesome'
# cask 'font-source-code-pro-for-powerline'
# cask 'font-source-code-pro'
# cask 'font-source-sans-pro'
